# Import Dependencies

In [3]:
# Import dependencies
import psycopg2
import matplotlib.pyplot as plt
import pandas as pd
from config import db_password
from config import db_name

# Data Retrieval

In [4]:
try:
    connection = psycopg2.connect(user = "postgres",
                                  password = db_password,
                                  host = "127.0.0.1",
                                  port = "5432",
                                  database = db_name)
    
    print("Connection established...")

    # Read Database Table information into Dataframes
    salary_data = pd.read_sql("SELECT * FROM Salaries", connection)
    
    avg_sal_by_title_query = '''SELECT t.title AS "title",
                                     ROUND(AVG(s.salary),2) AS "avg_salary"
                                FROM employees AS e
                                INNER JOIN Salaries AS s
                                ON e.emp_no = s.emp_no
                                INNER JOIN Titles AS t
                                ON e.emp_title_id = t.title_id
                                GROUP BY t.title'''
    
    avg_sal_by_title_data = pd.read_sql(avg_sal_by_title_query, connection)

    print("Retrieved Database Table information into Dataframes...")

except:
    print("Error while connecting/reading PostgreSQL")
finally:
    # closing database connection.
    if(connection):
        connection.close()
        print("PostgreSQL connection is closed")

Connection established...
Retrieved Database Table information into Dataframes...
PostgreSQL connection is closed

In [5]:
salary_data

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [7]:
avg_sal_by_title_data

                title  avg_salary
0  Assistant Engineer    48564.43
1            Engineer    48535.34
2             Manager    51531.04
3     Senior Engineer    48506.80
4        Senior Staff    58550.17
5               Staff    58465.38
6    Technique Leader    48582.90